#TP4 NLP: Criação do baseline



----
Aluno PPGI: Igor de Souza Lima

In [ ]:
import os
if "COLAB_" not in "".join(os.environ.keys()):
    !pip install unsloth
else:
    !pip install --no-deps bitsandbytes accelerate xformers==0.0.29.post3 peft trl==0.15.2 triton cut_cross_entropy unsloth_zoo
    !pip install sentencepiece protobuf "datasets>=3.4.1" huggingface_hub hf_transfer
    !pip install transformers==4.51.3
    !pip install --no-deps unsloth

Collecting bitsandbytes
  Downloading bitsandbytes-0.46.0-py3-none-manylinux_2_24_x86_64.whl.metadata (10 kB)
Requirement already satisfied: accelerate in /usr/local/lib/python3.11/dist-packages (1.7.0)
Collecting xformers==0.0.29.post3
  Downloading xformers-0.0.29.post3-cp311-cp311-manylinux_2_28_x86_64.whl.metadata (1.0 kB)
Requirement already satisfied: peft in /usr/local/lib/python3.11/dist-packages (0.15.2)
Collecting trl==0.15.2
  Downloading trl-0.15.2-py3-none-any.whl.metadata (11 kB)
Requirement already satisfied: triton in /usr/local/lib/python3.11/dist-packages (3.2.0)
Collecting cut_cross_entropy
  Downloading cut_cross_entropy-25.1.1-py3-none-any.whl.metadata (9.3 kB)
Collecting unsloth_zoo
  Downloading unsloth_zoo-2025.6.2-py3-none-any.whl.metadata (8.1 kB)
Downloading xformers-0.0.29.post3-cp311-cp311-manylinux_2_28_x86_64.whl (43.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 43.4/43.4 MB 24.8 MB/s eta 0:00:00
Downloading trl-0.15.2-py3-none-any.whl (318 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 318.9/318.9 kB 28.7 MB/s eta 0:00:00
Downloading bitsandbytes-0.46.0-py3-none-manylinux_2_24_x86_64.whl (67.0 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 67.0/67.0 MB 11.4 MB/s eta 0:00:00
Downloading cut_cross_entropy-25.1.1-py3-none-any.whl (22 kB)
Downloading unsloth_zoo-2025.6.2-py3-none-any.whl (149 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 149.1/149.1 kB 14.7 MB/s eta 0:00:00
Installing collected packages: xformers, unsloth_zoo, trl, cut_cross_entropy, bitsandbytes
Successfully installed bitsandbytes-0.46.0 cut_cross_entropy-25.1.1 trl-0.15.2 unsloth_zoo-2025.6.2 xformers-0.0.29.post3
Requirement already satisfied: sentencepiece in /usr/local/lib/python3.11/dist-packages (0.2.0)
Requirement already satisfied: protobuf in /usr/local/lib/python3.11/dist-packages (5.29.5)
Collecting datasets>=3.4.1
  Downloading datasets-3.6.0-py3-none-any.whl.metadata (19 kB)
Requirement already satisfied: huggingface_hub in /usr/local/lib/python3.11/dist-packages (0.33.0)
Requirement already satisfied: hf_transfer in /usr/local/lib/python3.11/dist-packages (0.1.9)
Requirement already satisfied: filelock in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (3.18.0)
Requirement already satisfied: numpy>=1.17 in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (2.0.2)
Requirement already satisfied: pyarrow>=15.0.0 in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (18.1.0)
Requirement already satisfied: dill<0.3.9,>=0.3.0 in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (0.3.7)
Requirement already satisfied: pandas in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (2.2.2)
Requirement already satisfied: requests>=2.32.2 in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (2.32.3)
Requirement already satisfied: tqdm>=4.66.3 in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (4.67.1)
Requirement already satisfied: xxhash in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (3.5.0)
Requirement already satisfied: multiprocess<0.70.17 in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (0.70.15)
Collecting fsspec<=2025.3.0,>=2023.1.0 (from fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1)
  Downloading fsspec-2025.3.0-py3-none-any.whl.metadata (11 kB)
Requirement already satisfied: packaging in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (24.2)
Requirement already satisfied: pyyaml>=5.1 in /usr/local/lib/python3.11/dist-packages (from datasets>=3.4.1) (6.0.2)
Requirement already satisfied: typing-extensions>=3.7.4.3 in /usr/local/lib/python3.11/dist-packages (from huggingface_hub) (4.14.0)
Requirement already satisfied: hf-xet<2.0.0,>=1.1.2 in /usr/local/lib/python3.11/dist-packages (from huggingface_hub) (1.1.3)
Requirement already satisfied: aiohttp!=4.0.0a0,!=4.0.0a1 in /usr/local/lib/python3.11/dist-packages (from fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1) (3.11.15)
Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.11/dist-packages (from requests>=2.32.2->datasets>=3.4.1) (3.4.2)
Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.11/dist-packages (from requests>=2.32.2->datasets>=3.4.1) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.11/dist-packages (from requests>=2.32.2->datasets>=3.4.1) (2.4.0)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.11/dist-packages (from requests>=2.32.2->datasets>=3.4.1) (2025.6.15)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.11/dist-packages (from pandas->datasets>=3.4.1) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.11/dist-packages (from pandas->datasets>=3.4.1) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.11/dist-packages (from pandas->datasets>=3.4.1) (2025.2)
Requirement already satisfied: aiohappyeyeballs>=2.3.0 in /usr/local/lib/python3.11/dist-packages (from aiohttp!=4.0.0a0,!=4.0.0a1->fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1) (2.6.1)
Requirement already satisfied: aiosignal>=1.1.2 in /usr/local/lib/python3.11/dist-packages (from aiohttp!=4.0.0a0,!=4.0.0a1->fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1) (1.3.2)
Requirement already satisfied: attrs>=17.3.0 in /usr/local/lib/python3.11/dist-packages (from aiohttp!=4.0.0a0,!=4.0.0a1->fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1) (25.3.0)
Requirement already satisfied: frozenlist>=1.1.1 in /usr/local/lib/python3.11/dist-packages (from aiohttp!=4.0.0a0,!=4.0.0a1->fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1) (1.7.0)
Requirement already satisfied: multidict<7.0,>=4.5 in /usr/local/lib/python3.11/dist-packages (from aiohttp!=4.0.0a0,!=4.0.0a1->fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1) (6.4.4)
Requirement already satisfied: propcache>=0.2.0 in /usr/local/lib/python3.11/dist-packages (from aiohttp!=4.0.0a0,!=4.0.0a1->fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1) (0.3.2)
Requirement already satisfied: yarl<2.0,>=1.17.0 in /usr/local/lib/python3.11/dist-packages (from aiohttp!=4.0.0a0,!=4.0.0a1->fsspec[http]<=2025.3.0,>=2023.1.0->datasets>=3.4.1) (1.20.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.11/dist-packages (from python-dateutil>=2.8.2->pandas->datasets>=3.4.1) (1.17.0)
Downloading datasets-3.6.0-py3-none-any.whl (491 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 491.5/491.5 kB 26.4 MB/s eta 0:00:00
Downloading fsspec-2025.3.0-py3-none-any.whl (193 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 193.6/193.6 kB 17.5 MB/s eta 0:00:00
Installing collected packages: fsspec, datasets
  Attempting uninstall: fsspec
    Found existing installation: fsspec 2025.3.2
    Uninstalling fsspec-2025.3.2:
      Successfully uninstalled fsspec-2025.3.2
  Attempting uninstall: datasets
    Found existing installation: datasets 2.14.4
    Uninstalling datasets-2.14.4:
      Successfully uninstalled datasets-2.14.4
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
unsloth-zoo 2025.6.2 requires msgspec, which is not installed.
unsloth-zoo 2025.6.2 requires tyro, which is not installed.
unsloth-zoo 2025.6.2 requires protobuf<4.0.0, but you have protobuf 5.29.5 which is incompatible.
torch 2.6.0+cu124 requires nvidia-cublas-cu12==12.4.5.8; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-cublas-cu12 12.5.3.2 which is incompatible.
torch 2.6.0+cu124 requires nvidia-cuda-cupti-cu12==12.4.127; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-cuda-cupti-cu12 12.5.82 which is incompatible.
torch 2.6.0+cu124 requires nvidia-cuda-nvrtc-cu12==12.4.127; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-cuda-nvrtc-cu12 12.5.82 which is incompatible.
torch 2.6.0+cu124 requires nvidia-cuda-runtime-cu12==12.4.127; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-cuda-runtime-cu12 12.5.82 which is incompatible.
torch 2.6.0+cu124 requires nvidia-cudnn-cu12==9.1.0.70; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-cudnn-cu12 9.3.0.75 which is incompatible.
torch 2.6.0+cu124 requires nvidia-cufft-cu12==11.2.1.3; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-cufft-cu12 11.2.3.61 which is incompatible.
torch 2.6.0+cu124 requires nvidia-curand-cu12==10.3.5.147; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-curand-cu12 10.3.6.82 which is incompatible.
torch 2.6.0+cu124 requires nvidia-cusolver-cu12==11.6.1.9; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-cusolver-cu12 11.6.3.83 which is incompatible.
torch 2.6.0+cu124 requires nvidia-cusparse-cu12==12.3.1.170; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-cusparse-cu12 12.5.1.3 which is incompatible.
torch 2.6.0+cu124 requires nvidia-nvjitlink-cu12==12.4.127; platform_system == "Linux" and platform_machine == "x86_64", but you have nvidia-nvjitlink-cu12 12.5.82 which is incompatible.
gcsfs 2025.3.2 requires fsspec==2025.3.2, but you have fsspec 2025.3.0 which is incompatible.
Successfully installed datasets-3.6.0 fsspec-2025.3.0
Collecting transformers==4.51.3
  Downloading transformers-4.51.3-py3-none-any.whl.metadata (38 kB)
Requirement already satisfied: filelock in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (3.18.0)
Requirement already satisfied: huggingface-hub<1.0,>=0.30.0 in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (0.33.0)
Requirement already satisfied: numpy>=1.17 in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (2.0.2)
Requirement already satisfied: packaging>=20.0 in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (24.2)
Requirement already satisfied: pyyaml>=5.1 in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (6.0.2)
Requirement already satisfied: regex!=2019.12.17 in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (2024.11.6)
Requirement already satisfied: requests in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (2.32.3)
Requirement already satisfied: tokenizers<0.22,>=0.21 in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (0.21.1)
Requirement already satisfied: safetensors>=0.4.3 in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (0.5.3)
Requirement already satisfied: tqdm>=4.27 in /usr/local/lib/python3.11/dist-packages (from transformers==4.51.3) (4.67.1)
Requirement already satisfied: fsspec>=2023.5.0 in /usr/local/lib/python3.11/dist-packages (from huggingface-hub<1.0,>=0.30.0->transformers==4.51.3) (2025.3.0)
Requirement already satisfied: typing-extensions>=3.7.4.3 in /usr/local/lib/python3.11/dist-packages (from huggingface-hub<1.0,>=0.30.0->transformers==4.51.3) (4.14.0)
Requirement already satisfied: hf-xet<2.0.0,>=1.1.2 in /usr/local/lib/python3.11/dist-packages (from huggingface-hub<1.0,>=0.30.0->transformers==4.51.3) (1.1.3)
Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.11/dist-packages (from requests->transformers==4.51.3) (3.4.2)
Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.11/dist-packages (from requests->transformers==4.51.3) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.11/dist-packages (from requests->transformers==4.51.3) (2.4.0)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.11/dist-packages (from requests->transformers==4.51.3) (2025.6.15)
Downloading transformers-4.51.3-py3-none-any.whl (10.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.4/10.4 MB 127.8 MB/s eta 0:00:00
Installing collected packages: transformers
  Attempting uninstall: transformers
    Found existing installation: transformers 4.52.4
    Uninstalling transformers-4.52.4:
      Successfully uninstalled transformers-4.52.4
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
unsloth-zoo 2025.6.2 requires msgspec, which is not installed.
unsloth-zoo 2025.6.2 requires tyro, which is not installed.
unsloth-zoo 2025.6.2 requires protobuf<4.0.0, but you have protobuf 5.29.5 which is incompatible.
Successfully installed transformers-4.51.3
Collecting unsloth
  Downloading unsloth-2025.6.3-py3-none-any.whl.metadata (47 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 47.1/47.1 kB 4.0 MB/s eta 0:00:00
Downloading unsloth-2025.6.3-py3-none-any.whl (277 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 277.9/277.9 kB 20.8 MB/s eta 0:00:00
Installing collected packages: unsloth
Successfully installed unsloth-2025.6.3

In [ ]:
import json
import sqlite3
import os
import torch
from unsloth import FastLanguageModel

# --- 1. CONFIGURAÇÃO DOS CAMINHOS E PARÂMETROS ---
DEV_FILE = "/dados/dev.json"
PROMPT_TEMPLATE_FILE = "/dados/prompt_template.txt"
DATABASE_DIR = "/dados/"  # Diretório que contém a pasta 'database'
SEED = 42

TEMPERATURE = 0.1
TOP_P = 0.95

# --- 2. FUNÇÃO OTIMIZADA E CORRIGIDA PARA CHAMAR O MODELO ---
def chamar_meu_modelo(model, tokenizer, prompt: str) -> str:
    """
    Recebe o modelo e o tokenizador já carregados e o prompt para gerar a consulta SQL.
    Esta versão foi corrigida para extrair APENAS a resposta do assistente.
    """
    messages = [
        {"role": "user", "content": prompt},
    ]

    inputs = tokenizer.apply_chat_template(
        messages,
        tokenize=True,
        add_generation_prompt=True,
        return_tensors="pt",
    ).to("cuda")

    outputs = model.generate(
        input_ids=inputs,
        max_new_tokens=256,
        use_cache=True,
        do_sample=True,
        temperature=TEMPERATURE,
        top_p=TOP_P,
    )

    # Decodifica a saída completa
    full_response = tokenizer.batch_decode(outputs, skip_special_tokens=True)[0]

    # **INÍCIO DA LÓGICA DE CORREÇÃO**
    try:
        # 1. Isola a parte da resposta do assistente usando o separador do Llama 3
        assistant_tag = "assistant\n\n" # O template do Llama 3 insere isso após o header.
        assistant_part = full_response.split(assistant_tag)[-1].strip()

        # 2. Procura por um bloco de código SQL dentro da resposta
        sql_block_start = assistant_part.find("```sql")
        if sql_block_start != -1:
            # Se encontrou o início do bloco, procura o fim
            sql_block_end = assistant_part.rfind("```")
            if sql_block_end > sql_block_start:
                # Extrai o conteúdo entre as tags ```sql e ```
                sql_code = assistant_part[sql_block_start + len("```sql") : sql_block_end].strip()
                return sql_code

        # 3. Se não houver bloco de código, retorna a resposta do assistente como está
        # (pode ser que o modelo tenha retornado apenas a SQL diretamente)
        return assistant_part

    except Exception:
        # Se qualquer parte da extração falhar, retorna a resposta completa como último recurso
        return full_response
    # **FIM DA LÓGICA DE CORREÇÃO**

# --- 3. LÓGICA PRINCIPAL DA AVALIAÇÃO (sem alterações) ---
def avaliar_baseline(model, tokenizer):
    try:
        with open(DEV_FILE, 'r', encoding='utf-8') as f:
            dev_data = json.load(f)
        with open(PROMPT_TEMPLATE_FILE, 'r', encoding='utf-8') as f:
            prompt_template = f.read()
    except FileNotFoundError as e:
        print(f"Erro: Arquivo não encontrado - {e}. Verifique os caminhos.")
        return

    sucessos = 0
    falhas = 0
    total = len(dev_data)

    for i, item in enumerate(dev_data):
        pergunta = item['question']
        db_id = item['db_id']
        sql_correta = item['query']

        print(f"\n--- AVALIANDO ITEM {i+1}/{total} | BANCO DE DADOS: {db_id} ---")
        print(f"PERGUNTA: {pergunta}")

        prompt_final = prompt_template.replace('{your_new_question_here}', pergunta)
        sql_gerada = chamar_meu_modelo(model, tokenizer, prompt_final)

        # Remove ponto e vírgula do final, se houver, para evitar erros no SQLite
        if sql_gerada.endswith(';'):
            sql_gerada = sql_gerada[:-1]

        print(f"SQL GERADA: {sql_gerada}")
        print(f"SQL CORRETA: {sql_correta}")

        db_path = os.path.join(DATABASE_DIR, 'database', db_id, f'{db_id}.sqlite')

        if not os.path.exists(db_path):
            print(f"  -> FALHA (Erro: Banco de dados não encontrado em '{db_path}')")
            falhas += 1
            continue

        try:
            conn = sqlite3.connect(db_path)
            cursor_gerada = conn.cursor()
            cursor_correta = conn.cursor()

            cursor_gerada.execute(sql_gerada)
            resultado_gerado = cursor_gerada.fetchall()

            cursor_correta.execute(sql_correta)
            resultado_correto = cursor_correta.fetchall()

            if resultado_gerado == resultado_correto:
                print("  -> SUCESSO (Resultados idênticos)")
                sucessos += 1
            else:
                print("  -> FALHA (Resultado diferente do esperado)")
                falhas += 1

        except sqlite3.Error as e:
            print(f"  -> FALHA (Erro de execução SQL: {e})")
            falhas += 1

        finally:
            if 'conn' in locals():
                conn.close()

    # --- 4. EXIBIR RESULTADOS FINAIS ---
    print("\n\n--- AVALIAÇÃO DO BASELINE CONCLUÍDA ---")
    print(f"Total de Perguntas Avaliadas: {total}")
    print(f"Sucessos: {sucessos}")
    print(f"Falhas: {falhas}")

    taxa_de_sucesso = (sucessos / total) * 100 if total > 0 else 0
    print(f"Taxa de Sucesso (Execution Accuracy): {taxa_de_sucesso:.2f}%")


if __name__ == '__main__':
    torch.manual_seed(SEED)

    print("Carregando o modelo e o tokenizador...")
    model, tokenizer = FastLanguageModel.from_pretrained(
        model_name="unsloth/Llama-3.2-3B-Instruct-bnb-4bit",
        max_seq_length=2048,
        dtype=None,
        load_in_4bit=True,
    )

    FastLanguageModel.for_inference(model)
    print("Modelo carregado com sucesso.")

    avaliar_baseline(model, tokenizer)

A saída de streaming foi truncada nas últimas 5000 linhas.
FROM tv_series AS T1
ORDER BY T1.rating DESC
LIMIT 3
SQL CORRETA: SELECT Episode ,  Rating FROM TV_series ORDER BY Rating DESC LIMIT 3;
  -> SUCESSO (Resultados idênticos)

--- AVALIANDO ITEM 617/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What are 3 most highly rated episodes in the TV series table and what were those ratings?
SQL GERADA: SELECT title, rating
FROM tv_series
ORDER BY rating DESC
LIMIT 3
SQL CORRETA: SELECT Episode ,  Rating FROM TV_series ORDER BY Rating DESC LIMIT 3;
  -> FALHA (Erro de execução SQL: no such column: title)

--- AVALIANDO ITEM 618/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is minimum and maximum share of TV series?
SQL GERADA: SELECT
    (min(tv_series.num_episodes) / (SELECT COUNT(*) FROM tv_series)) AS min_share,
    (max(tv_series.num_episodes) / (SELECT COUNT(*) FROM tv_series)) AS max_share
FROM
    tv_series
SQL CORRETA: SELECT max(SHARE) , min(SHARE) FROM TV_series;
  -> FALHA (Erro de execução SQL: no such column: tv_series.num_episodes)

--- AVALIANDO ITEM 619/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the maximum and minimum share for the TV series?
SQL GERADA: SELECT MAX(share) AS max_share, MIN(share) AS min_share
FROM show
WHERE genre = 'TV series'
SQL CORRETA: SELECT max(SHARE) , min(SHARE) FROM TV_series;
  -> FALHA (Erro de execução SQL: no such table: show)

--- AVALIANDO ITEM 620/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the air date of TV series with Episode "A Love of a Lifetime"?
SQL GERADA: SELECT air_date
FROM tv_series
WHERE title = 'A Love of a Lifetime'
SQL CORRETA: SELECT Air_Date FROM TV_series WHERE Episode = "A Love of a Lifetime";
  -> FALHA (Erro de execução SQL: no such column: title)

--- AVALIANDO ITEM 621/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: When did the episode "A Love of a Lifetime" air?
SQL GERADA: To translate the natural language question "When did the episode 'A Love of a Lifetime' air?" into a SQL query, we need to identify the relevant tables and columns.

Assuming that the episode information is stored in a table called 'episodes' and the air dates are stored in a column called 'air_date', the SQL query would be:

SELECT air_date FROM episodes WHERE title = 'A Love of a Lifetime'

This query selects the air_date column from the episodes table where the title column is equal to 'A Love of a Lifetime'.
SQL CORRETA: SELECT Air_Date FROM TV_series WHERE Episode = "A Love of a Lifetime";
  -> FALHA (Erro de execução SQL: near "To": syntax error)

--- AVALIANDO ITEM 622/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is Weekly Rank of TV series with Episode "A Love of a Lifetime"?
SQL GERADA: SELECT tvs.weekly_rank
FROM tv_series AS tvs
JOIN tv_series_episode AS tse ON tvs.tv_series_id = tse.tv_series_id
JOIN episode AS e ON tse.episode_id = e.episode_id
WHERE e.title = 'A Love of a Lifetime'
SQL CORRETA: SELECT Weekly_Rank FROM TV_series WHERE Episode = "A Love of a Lifetime";
  -> FALHA (Erro de execução SQL: no such table: tv_series_episode)

--- AVALIANDO ITEM 623/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the weekly rank for the episode "A Love of a Lifetime"?
SQL GERADA: SELECT T1.weekly_rank
FROM episodes AS T1
JOIN episodes_table AS T2 ON T1.id = T2.id
WHERE T2.episode_name = 'A Love of a Lifetime';
```

However, this query may not be efficient if the "episodes" table is very large, as it would require joining the table with itself. A more efficient approach would be to use a single table with the necessary columns, like this:

```sql
SELECT weekly_rank
FROM episodes
WHERE episode_name = 'A Love of a Lifetime'
SQL CORRETA: SELECT Weekly_Rank FROM TV_series WHERE Episode = "A Love of a Lifetime";
  -> FALHA (Erro de execução SQL: no such table: episodes)

--- AVALIANDO ITEM 624/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the TV Channel of TV series with Episode "A Love of a Lifetime"? List the TV Channel's series name.
SQL GERADA: SELECT T1.tv_channel, T1.series_name FROM tv_series AS T1 JOIN episode AS T2 ON T1.tv_series_id = T2.tv_series_id WHERE T2.episode_name = 'A Love of a Lifetime'
SQL CORRETA: SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";
  -> FALHA (Erro de execução SQL: no such table: episode)

--- AVALIANDO ITEM 625/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the name of the series that has the episode "A Love of a Lifetime"?
SQL GERADA: SELECT T1.series_name
FROM movie AS T1
JOIN episode AS T2 ON T1.movie_id = T2.movie_id
WHERE T2.episode_name = 'A Love of a Lifetime'
SQL CORRETA: SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";
  -> FALHA (Erro de execução SQL: no such table: movie)

--- AVALIANDO ITEM 626/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: List the Episode of all  TV series showed on TV Channel with series name "Sky Radio".
SQL GERADA: SELECT T1.episode
FROM tv_series AS T1
JOIN tv_channel AS T2 ON T1.tv_channel_id = T2.tv_channel_id
WHERE T1.series_name = 'Sky Radio'
SQL CORRETA: SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";
  -> FALHA (Erro de execução SQL: no such column: T1.series_name)

--- AVALIANDO ITEM 627/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the episode for the TV series named "Sky Radio"?
SQL GERADA: SELECT T1.episode
FROM tv_series AS T1
JOIN episodes AS T2 ON T1.tv_series_id = T2.tv_series_id
WHERE T1.name = 'Sky Radio'
SQL CORRETA: SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";
  -> FALHA (Erro de execução SQL: no such table: episodes)

--- AVALIANDO ITEM 628/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: Find the number of cartoons directed by each of the listed directors.
SQL GERADA: SELECT director, COUNT(*) AS num_cartoons
FROM movie
WHERE genre = 'cartoon'
GROUP BY director;
```

This query works as follows:

- It selects the `director` column and counts the number of rows for each director using the `COUNT(*)` function.
- It filters the results to only include rows where the `genre` is 'cartoon'.
- It groups the results by the `director` column, so that the count is calculated separately for each director.

However, since the problem statement does not specify the listed directors, we will assume that the directors are specified in the `movie` table. If the directors are specified in a different table, you would need to join that table to the `movie` table.

For example, if the directors are specified in a `director` table, you would use the following query:

```sql
SELECT d.director, COUNT(*) AS num_cartoons
FROM movie m
JOIN director d ON m.director_id = d.director_id
WHERE m.genre = 'cartoon'
GROUP BY d.director
SQL CORRETA: SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by
  -> FALHA (Erro de execução SQL: no such table: movie)

--- AVALIANDO ITEM 629/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: How many cartoons did each director create?
SQL GERADA: To answer the final task, we need to translate the natural language question into a SQL query. Here's the solution:

Question: How many cartoons did each director create?

SQL:
SELECT director, COUNT(*) AS num_cartoons
FROM movie
WHERE genre = 'cartoon'
GROUP BY director
SQL CORRETA: SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by
  -> FALHA (Erro de execução SQL: near "To": syntax error)

--- AVALIANDO ITEM 630/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: Find the production code and channel of the most recently aired cartoon .
SQL GERADA: SELECT T1.production_code, T1.channel
FROM cartoon AS T1
WHERE T1.air_date = (SELECT MAX(air_date) FROM cartoon)
SQL CORRETA: select production_code ,  channel from cartoon order by original_air_date desc limit 1
  -> FALHA (Erro de execução SQL: no such column: T1.air_date)

--- AVALIANDO ITEM 631/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the produdction code and channel of the most recent cartoon ?
SQL GERADA: SELECT production_code, channel
FROM cartoon
ORDER BY release_year DESC
LIMIT 1
SQL CORRETA: select production_code ,  channel from cartoon order by original_air_date desc limit 1
  -> FALHA (Erro de execução SQL: no such column: release_year)

--- AVALIANDO ITEM 632/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: Find the package choice and series name of the TV channel that has high definition TV.
SQL GERADA: SELECT package_choice, series_name
FROM tv_channel
WHERE hd_tv = 'Yes'
SQL CORRETA: SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"
  -> FALHA (Erro de execução SQL: no such column: package_choice)

--- AVALIANDO ITEM 633/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What are the package options and the name of the series for the TV Channel that supports high definition TV?
SQL GERADA: To translate the given natural language question into a SQL query, we need to identify the relevant tables, columns, joins, and aggregations.

The question is: "What are the package options and the name of the series for the TV Channel that supports high definition TV?"

Based on the provided examples, we can assume the following table structure:

- `movie`: This table contains information about movies, including `title`, `YEAR`, `director`, and `budget_million`.
- `culture_company`: This table contains information about companies, including `company_name` and `book_club_id`.
- `book_club`: This table contains information about book clubs, including `publisher` and `book_club_id`.
- `tv_channel`: This table contains information about TV channels, including `channel_name` and `package_options`.

To answer the question, we need to join the `movie` table with the `tv_channel` table and filter the results to include only TV channels that support high definition TV. We also need to join the `culture_company` table with the `book_club` table to filter the results to include only book clubs published by Alyson.

Here's the SQL query:

```sql
SELECT T1.package_options, T1.channel_name
SQL CORRETA: SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"
  -> FALHA (Erro de execução SQL: near "To": syntax error)

--- AVALIANDO ITEM 634/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: which countries' tv channels are playing some cartoon written by Todd Casey?
SQL GERADA: SELECT T1.country
FROM movie AS T1
JOIN tv_channel AS T2 ON T1.country = T2.country
JOIN cartoon AS T3 ON T1.title = T3.title
WHERE T3.writer = 'Todd Casey'
SQL CORRETA: SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
  -> FALHA (Erro de execução SQL: no such table: movie)

--- AVALIANDO ITEM 635/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What are the countries that have cartoons on TV that were written by Todd Casey?
SQL GERADA: SELECT T1.country
FROM culture_company AS T1
JOIN book_club AS T2 ON T1.book_club_id = T2.book_club_id
WHERE T2.publisher = 'Todd Casey' AND T1.cartoon = 'TV';
```
However, the above query may not be accurate because the 'cartoon' column in the culture_company table may not directly indicate if the company produces cartoons for TV. A more accurate query would be:
SQL CORRETA: SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
  -> FALHA (Erro de execução SQL: no such table: culture_company)

--- AVALIANDO ITEM 636/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: which countries' tv channels are not playing any cartoon written by Todd Casey?
SQL GERADA: To translate the given natural language question into a SQL query, we need to break down the question and identify the relevant tables, columns, joins, and aggregations.

Question: which countries' tv channels are not playing any cartoon written by Todd Casey?

Table: culture_company (contains information about companies)
Table: book_club (contains information about books and their publishers)
Table: movie (contains information about movies)

Columns:
- culture_company: company_name
- book_club: book_club_id, publisher
- movie: title, YEAR, director, budget_million

Join: culture_company and book_club on book_club_id
Join: book_club and movie on book_club_id

Aggregation: None

SQL Query:
```sql
SELECT T1.country_name
FROM culture_company AS T1
LEFT JOIN book_club AS T2 ON T1.book_club_id = T2.book_club_id
LEFT JOIN movie AS T3 ON T2.book_club_id = T3.book_club_id
WHERE T3.title LIKE '%cartoon%' AND T3.director = 'Todd Casey'
AND T1.company_name NOT IN (
  SELECT T4.publisher
  FROM book_club AS T4
  WHERE
SQL CORRETA: SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
  -> FALHA (Erro de execução SQL: near "To": syntax error)

--- AVALIANDO ITEM 637/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What are the countries that are not playing cartoons written by Todd Casey?
SQL GERADA: SELECT T1.country
FROM movie AS T1
LEFT JOIN culture_company AS T2 ON T1.country_id = T2.country_id
LEFT JOIN book_club AS T3 ON T2.book_club_id = T3.book_club_id
WHERE T3.publisher = 'Alyson' AND T1.title NOT LIKE '%cartoon%' AND T1.director = 'Todd Casey'
SQL CORRETA: SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
  -> FALHA (Erro de execução SQL: no such table: movie)

--- AVALIANDO ITEM 638/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: Find the series name and country of the tv channel that is playing some cartoons directed by Ben Jones and Michael Chang?
SQL GERADA: To translate the given natural language question into a SQL query, we need to break down the question and identify the relevant tables, columns, joins, and aggregations.

Question: Find the series name and country of the tv channel that is playing some cartoons directed by Ben Jones and Michael Chang?

Let's analyze the question:

- The tv channel is playing cartoons.
- The cartoons are directed by Ben Jones and Michael Chang.
- We need to find the series name and country of the tv channel.

Based on the provided examples, we can infer that:

- The table for tv channels is `tv_channel`.
- The table for cartoons is `cartoon`.
- The table for directors is `director`.
- The table for series is `series`.

We can join these tables based on the relationships between them. The `cartoon` table has a foreign key `director_id` that references the `id` column in the `director` table. The `cartoon` table also has a foreign key `tv_channel_id` that references the `id` column in the `tv_channel` table. The `cartoon` table has a foreign key `series_id` that references the `id` column in the `series` table.

Here's the SQL query:

```sql
SQL CORRETA: SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'
  -> FALHA (Erro de execução SQL: near "To": syntax error)

--- AVALIANDO ITEM 639/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the series name and country of all TV channels that are playing cartoons directed by Ben Jones and cartoons directed by Michael Chang?
SQL GERADA: SELECT
    T1.series_name,
    T1.country
FROM
    tv_channel AS T1
JOIN
    cartoon AS T2 ON T1.country = T2.country
WHERE
    T2.director = 'Ben Jones'
    OR T2.director = 'Michael Chang'
SQL CORRETA: SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'
  -> FALHA (Erro de execução SQL: no such column: T2.director)

--- AVALIANDO ITEM 640/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: find the pixel aspect ratio and nation of the tv channels that do not use English.
SQL GERADA: SELECT
    pixel_aspect_ratio,
    nation
FROM
    tv_channel
WHERE
    language!= 'English'
SQL CORRETA: SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'
  -> FALHA (Erro de execução SQL: no such column: pixel_aspect_ratio)

--- AVALIANDO ITEM 641/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What is the pixel aspect ratio and country of origin for all TV channels that do not use English?
SQL GERADA: SELECT
  channel_settings.pixel_aspect_ratio,
  tv_channels.country_of_origin
FROM
  tv_channels
  LEFT JOIN channel_settings ON tv_channels.channel_id = channel_settings.channel_id
WHERE
  tv_channels.language!= 'English'
SQL CORRETA: SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'
  -> FALHA (Erro de execução SQL: no such table: tv_channels)

--- AVALIANDO ITEM 642/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: find id of the tv channels that from the countries where have more than two tv channels.
SQL GERADA: SELECT T1.id
FROM tv_channel AS T1
JOIN country AS T2 ON T1.country_id = T2.id
WHERE T2.num_tv_channels > 2;
```

This query works as follows:

- It selects the id column from the tv_channel table (aliased as T1).
- It joins the tv_channel table with the country table (aliased as T2) on the country_id column.
- It filters the results to include only the rows where the num_tv_channels column in the country table is greater than 2.

However, the above query will return the id of the tv channels, but it will not return the country name. If you want to include the country name in the output, you can modify the query as follows:

```sql
SELECT T1.id, T2.country_name
FROM tv_channel AS T1
JOIN country AS T2 ON T1.country_id = T2.id
WHERE T2.num_tv_channels > 2
SQL CORRETA: SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2
  -> FALHA (Erro de execução SQL: no such table: country)

--- AVALIANDO ITEM 643/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What are the ids of all tv channels that have more than 2 TV channels?
SQL GERADA: SELECT id
FROM tv_channel
WHERE id IN (
  SELECT channel_id
  FROM tv_channel
  GROUP BY channel_id
  HAVING COUNT(*) > 2
)
SQL CORRETA: SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2
  -> FALHA (Erro de execução SQL: no such column: channel_id)

--- AVALIANDO ITEM 644/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: find the id of tv channels that do not play any cartoon directed by Ben Jones.
SQL GERADA: SELECT T1.id
FROM tv_channel AS T1
LEFT JOIN movie AS T2 ON T1.id = T2.channel_id
LEFT JOIN cartoon AS T3 ON T2.id = T3.movie_id
WHERE T3.director = 'Ben Jones' AND T3.id IS NULL
SQL CORRETA: SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'
  -> FALHA (Erro de execução SQL: no such table: movie)

--- AVALIANDO ITEM 645/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: What are the ids of the TV channels that do not have any cartoons directed by Ben Jones?
SQL GERADA: SELECT T1.id
FROM tv_channel AS T1
LEFT JOIN cartoon AS T2 ON T1.id = T2.tv_channel_id
LEFT JOIN director AS T3 ON T2.director_id = T3.id
WHERE T3.name = 'Ben Jones' AND T2.title IS NULL
SQL CORRETA: SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'
  -> FALHA (Erro de execução SQL: no such table: director)

--- AVALIANDO ITEM 646/1034 | BANCO DE DADOS: tvshow ---
PERGUNTA: find the package option of the tv channel that do not have any cartoon directed by Ben Jones.
SQL GERADA: To translate the given natural language question into a SQL query, we need to break down the question and identify the relevant tables, columns, joins, and aggregations.
